#+TITLE: Second Life UPS

#+BEGIN_EXPORT html
<base href="secondlife-ups/"/>
#+END_EXPORT

* Overview

I have decided to build a UPS that would power my home network equipment rack using lithium-ion 18650 cells.

- image of rack
  
First let's lay out some basic design considerations
- should fit the equipment rack in a 1U format
- it should provide 12V DC, 5V DC as well as 230V for the switch

The current list of devices that need to be powered by the UPS together with their nameplate voltage and current consumption information:

|----------------+-------------+-------------------+-----------------+---------------------------------------------------------------------|
| Device         | Voltage [V] | Current (max) [A] | Power (max) [W] | Notes                                                               |
|----------------+-------------+-------------------+-----------------+---------------------------------------------------------------------|
| Router         |          19 |                 2 |              38 | A small form factor PC                                              |
| 16-port switch |     230V AC |               0.1 |            22.5 | Rated at 22.5 W in the [[https://www.cnet.com/products/3com-baseline-plus-switch-2920-switch-16-ports-managed-desktop-series/][technical specs]]                              |
| AP             |          24 |              0.25 |             6.5 | Rated at 6.5 W (see [[https://dl.ui.com/datasheets/unifi/UniFi_AC_APs_DS.pdf][datasheet]]), passive 24V PoE Mode B (230V/0.02A) |
| Raspberry Pi   |           5 |               2.1 |              10 |                                                                     |
| GPON modem     |          12 |               0.5 |               6 |                                                                     |
|----------------+-------------+-------------------+-----------------+---------------------------------------------------------------------|
| Total          |             |                   |             83. |                                                                     |
|----------------+-------------+-------------------+-----------------+---------------------------------------------------------------------|
#+TBLFM: @>$4=vsum(@2..@-1)

As can be seen there is a large amount of different voltages required in order to power all of the devices, therefore some modifications and compromises will have to be made:

- The UPS will provide stabilized 12 V and 5 V power rails
- The 19V for the router will be provided by a dedicated step-up dc-dc converter based on the very popular XL6009 chip from aliexpress
- The 230V AC will be temporarily provided by a small car 12V -> 230V inverter
- The PoE injector is scheduled to be replaced by an PoE injector which can be powered from DC
- The router will be replaced in the future with a Mikrotik Routerboard or a PFsense appliance from https://teklager.se/en/pfsense-hardware/ that both can be powered from DC
- The switch will be modded to have a DC power supply

The 1U case that I want to use for this is a case from a switch:

... empty case photo ...

I have removed everything from the switch case except the colling fan and the LED board. The LED board I intend to use to provide visual status information about the UPS
(such as battery level and load). The fan will come in handy to get rid of heat.

The case has 1U dimensions, to be exact xx . xx . xx mm.

The case size puts a limit on the size and shape of two biggest internal components - the battery pack and the 230V AC power supply. I have devised the following placement
for these main components.

... layout with battery ...

power supply: https://www.aliexpress.com/item/33042313383.html

